const authors = [
    {
        name: "李白",
        image: "https://guwen-1252396323.cos.ap-chengdu.myqcloud.com/headImage/20180914152354795.jpg",
        intro: "李白（701年－762年），字太白，号青莲居士，唐朝浪漫主义诗人，被后人誉为“诗仙”。"
    },
    {
        name: "杜甫",
        image: "https://guwen-1252396323.cos.ap-chengdu.myqcloud.com/headImage/20180914152354796.jpg",
        intro: "杜甫（712年－770年），字子美，自号少陵野老，唐代现实主义诗人，被后人称为“诗圣”。"
    },
    {
        name: "白居易",
        image: "https://gxwtf.cn/uploads/1747463228661-585143172.jpg",
        intro: "白居易（772年－846年），字乐天，号香山居士，又号醉吟先生，祖籍太原，到其曾祖父时迁居下邽，生于河南新郑。是唐代伟大的现实主义诗人，唐代三大诗人之一。白居易与元稹共同倡导新乐府运动，世称“元白”，与刘禹锡并称“刘白”。白居易的诗歌题材广泛，形式多样，语言平易通俗，有“诗魔”和“诗王”之称。官至翰林学士、左赞善大夫。公元846年，白居易在洛阳逝世，葬于香山。有《白氏长庆集》传世，代表诗作有《长恨歌》《卖炭翁》《琵琶行》等。"
    }
];
exports.default = authors;
