/**
 * junior 合集
 */
const poems = [
    {
        "title": "观沧海",
        "dynasty": "东汉末",
        "author": "曹操",
        "tags": [
            "七上",
            "诗",
            "乐府诗"
        ],
        "display": "center",
        "content": [
            {
                "line": "东临碣石，以观沧海。",
                "trans": "东行登上高高的碣石山，来观赏苍茫的大海。",
                "pinyin": "乌桓是当时东北方的大患，建安十一年（206年），乌桓攻破幽州，俘虏了汉民十余万户。同年，袁绍的儿子袁尚和袁熙又勾结辽西乌桓首领蹋顿，屡次骚扰边境，以致曹操不得不在建安十二年（207年）毅然决定北上征伐乌桓。后来在田畴的指引下，小用计策。大约在这年八月的一次大战中，曹操终于取得了决定性的胜利。这次胜利巩固了曹操的后方，奠定了次年挥戈南下，以期实现统一中国的宏愿。而《观沧海》正是北征乌桓得胜回师经过碣石山时写的。"
            },
            {
                "line": "水何澹澹，山岛竦峙。",
                "trans": "海水多么宽阔浩荡，海中山岛罗列，高耸挺立。",
                "pinyin": "《观沧海》是一首四言乐府诗，是诗人在碣石山登山望海时，用饱蘸浪漫主义激情的大笔，所勾勒出大海吞吐日月、包蕴万千的壮丽景象，摹写出祖国河山的雄伟壮丽。全诗语言质朴，想象丰富；气势磅礴，苍凉悲壮。吐露出诗人建功立业、施展抱负的雄心壮志；表现了他一揽天下、豪迈自信的胸怀；抒发了积极进取、胸怀天下的思想感情。"
            },
            {
                "line": "树木丛生，百草丰茂。",
                "trans": "周围树木葱茏，各种草植生长茂盛。",
                "pinyin": ""
            },
            {
                "line": "秋风萧瑟，洪波涌起。",
                "trans": "萧瑟的风声传来，草木动摇，海中翻涌着巨大的海浪。",
                "pinyin": ""
            },
            {
                "line": "日月之行，若出其中；",
                "trans": "太阳和月亮升起降落，好像是从这浩瀚的海洋中发出的。",
                "pinyin": ""
            },
            {
                "line": "星汉灿烂，若出其里。",
                "trans": "天河里的灿烂群星，也好像是从大海的怀抱里涌现出来的。",
                "pinyin": ""
            },
            {
                "line": "幸甚至哉，歌以咏志。",
                "trans": "太值得庆幸了！就用诗歌来表达心志吧。",
                "pinyin": ""
            }
        ],
        "background": "《观沧海》是一首四言乐府诗，是诗人在碣石山登山望海时，用饱蘸浪漫主义激情的大笔，所勾勒出大海吞吐日月、包蕴万千的壮丽景象，摹写出祖国河山的雄伟壮丽。全诗语言质朴，想象丰富；气势磅礴，苍凉悲壮。吐露出诗人建功立业、施展抱负的雄心壮志；表现了他一揽天下、豪迈自信的胸怀；抒发了积极进取、胸怀天下的思想感情。",
        "analysis": ""
    }
];
export default poems;