/**
 * senior 合集
 */
const poems = [
    {
        "title": "沁园春·长沙",
        "dynasty": "现代",
        "author": "毛泽东",
        "tags": [
            "必修一",
            "词"
        ],
        "display": "center",
        "content": [
            {
                "line": "独立寒秋，湘江北去，橘子洲头。",
                "trans": "在深秋一个秋高气爽的日子里，眺望着湘江碧水缓缓北流。我独自伫立在橘子洲头。"
            },
            {
                "line": "看万山红遍，层林尽染；",
                "trans": "看万千山峰全都变成了红色，一层层树林好像染过颜色一样；"
            },
            {
                "line": "漫江碧透，百舸争流。",
                "trans": "江水清澈澄碧，一艘艘大船乘风破浪，争先恐后。"
            },
            {
                "line": "鹰击长空，鱼翔浅底，万类霜天竞自由。",
                "trans": "广阔的天空里鹰在矫健有力地飞，鱼在清澈的水里轻快地游着，万物都在秋光中争着过自由自在的生活。"
            },
            {
                "line": "怅寥廓，问苍茫大地，谁主沉浮？",
                "trans": "面对着无边无际的宇宙，（千万种思绪一齐涌上心头）我要问：这苍茫大地的盛衰兴废，由谁来决定主宰呢？"
            },
            {
                "line": "携来百侣曾游。忆往昔峥嵘岁月稠。",
                "trans": "回想过去，我和我的同学，经常携手结伴来到这里游玩。在一起商讨国家大事，那无数不平凡的岁月至今还萦绕在我的心头。"
            },
            {
                "line": "恰同学少年，风华正茂；",
                "trans": "同学们正值青春年少，风华正茂；"
            },
            {
                "line": "书生意气，挥斥方遒。",
                "trans": "大家踌躇满志，意气奔放，正强劲有力。"
            },
            {
                "line": "指点江山，激扬文字，粪土当年万户侯。",
                "trans": "评论国家大事，写出这些激浊扬清的文章，把当时那些军阀官僚看得如同粪土。"
            },
            {
                "line": "曾记否，到中流击水，浪遏飞舟？",
                "trans": "可曾记得，那时我们在江水深急的地方游泳，那激起的浪花几乎挡住了疾驰而来的船？"
            }
        ]
    },
    {
        "title": "赤壁赋",
        "dynasty": "宋",
        "author": "苏轼",
        "tags": [
            "必修一",
            "文言文",
            "背默"
        ],
        "display": "left",
        "content": [
            {
                "line": "壬戌之秋，七月既望，苏子与客泛舟游于赤壁之下。清风徐来，水波不兴。举酒属客，诵明月之诗，歌窈窕之章。少焉，月出于东山之上，徘徊于斗牛之间。白露横江，水光接天。纵一苇之所如，凌万顷之茫然。浩浩乎如冯虚御风，而不知其所止；飘飘乎如遗世独立，羽化而登仙。",
                "trans": "壬戌年秋天，七月十六日，我与友人在赤壁下泛舟游玩。清风阵阵拂来，水面波澜不起。举起酒杯向同伴劝酒，吟诵《明月》中“窈窕”这一章。不一会儿，明月从东山后升起，在斗宿与牛宿之间来回移动。月光下，白茫茫的雾气笼罩江面，天光、水色连成一片。任凭一片苇叶似的小船随意漂浮，越过浩瀚无垠的江面。浩浩淼淼（像长出羽翼一样）驾风凌空飞行，并不知道到哪里才会停栖，飘飘摇摇好像要离开尘世飘飞而起，羽化成仙进入仙境。"
            },
            {
                "line": "于是饮酒乐甚，扣舷而歌之。歌曰：“桂棹兮兰桨，击空明兮溯流光。渺渺兮予怀，望美人兮天一方。”客有吹洞箫者，倚歌而和之。其声呜呜然，如怨如慕，如泣如诉；余音袅袅，不绝如缕。舞幽壑之潜蛟，泣孤舟之嫠妇。",
                "trans": "在这时喝酒喝得非常高兴，打着节拍唱起歌来。歌中唱到：“桂木船棹啊香兰船桨，击打着月光下的清波，在泛着月光的水面逆流而上。我的情思啊悠远茫茫，眺望美人（君主）啊，却在天的另一方。”有会吹洞箫的客人，配着节奏为歌声伴和，洞箫的声音呜呜咽咽：有如哀怨有如思慕，既像啜泣也像倾诉，余音在江上回荡，像细丝一样连续不断。能使深谷中的蛟龙为之起舞，能使孤舟上的寡妇为之饮泣。"
            },
            {
                "line": "苏子愀然，正襟危坐而问客曰：“何为其然也？”客曰：“‘月明星稀，乌鹊南飞’，此非曹孟德之诗乎？西望夏口，东望武昌，山川相缪，郁乎苍苍，此非孟德之困于周郎者乎？方其破荆州，下江陵，顺流而东也，舳舻千里，旌旗蔽空，酾酒临江，横槊赋诗，固一世之雄也，而今安在哉？况吾与子渔樵于江渚之上，侣鱼虾而友麋鹿，驾一叶之扁舟，举匏樽以相属。寄蜉蝣于天地，渺沧海之一粟。哀吾生之须臾，羡长江之无穷。挟飞仙以遨游，抱明月而长终。知不可乎骤得，托遗响于悲风。”",
                "trans": "我的神色也愁惨起来，整好衣襟坐端正，向客人问道：“箫声为什么这样哀怨呢？”客人回答：“‘月明星稀，乌鹊南飞’，这不是曹公孟德的诗么？这里向西可以望到夏口，向东可以望到武昌，山河接壤连绵不绝，目力所及，一片郁郁苍苍。这不正是曹孟德被周瑜所围困的地方么？当初他攻陷荆州，夺得江陵，沿长江顺流东下，麾下的战船首尾相连延绵千里，旗子将天空全都蔽住，面对大江斟酒，横执长矛吟诗，本来是当世的一位英雄人物，然而现在又在哪里呢？何况我与你在江中的小洲打渔砍柴，以鱼虾为侣，以麋鹿为友，在江上驾着这一叶小舟，举起杯盏相互敬酒，如同蜉蝣置身于广阔的天地中，像沧海中的一粒粟米那样渺小。唉，哀叹我们的一生只是短暂的片刻，不由羡慕长江的没有穷尽。想要携同仙人携手遨游各地，与明月相拥而永存世间。知道上面这些想法不能一下子实现，只得将憾恨化为箫音，托寄在悲凉的秋风中罢了。”"
            },
            {
                "line": "苏子曰：“客亦知夫水与月乎？逝者如斯，而未尝往也；盈虚者如彼，而卒莫消长也。盖将自其变者而观之，则天地曾不能以一瞬；自其不变者而观之，则物与我皆无尽也，而又何羡乎！且夫天地之间，物各有主，苟非吾之所有，虽一毫而莫取。惟江上之清风，与山间之明月，耳得之而为声，目遇之而成色，取之无禁，用之不竭。是造物者之无尽藏也，而吾与子之所共适。”",
                "trans": "我问道：“你可也知道这水与月？江水总是不停的流逝，但它们并没有流走；月亮总是那样有圆有缺，但它终究也没有增减。可见，从事物易变的一面看来，天地间万事万物时刻在变动，连一眨眼的工夫都不停止；而从事物不变的一面看来，万物同我们来说都是永恒的，又有什么可羡慕的呢？何况天地之间，万物各有主宰者，若不是自己应该拥有的，即使一分一毫也不能求取。只有江上的清风，以及山间的明月，听到便成了声音，进入眼帘便绘出形色，取得这些不会有人禁止，感受这些也不会有竭尽的忧虑。这是大自然恩赐的没有穷尽的宝藏，我和你可以共同享受。”"
            },
            {
                "line": "客喜而笑，洗盏更酌。肴核既尽，杯盘狼籍。相与枕藉乎舟中，不知东方之既白。",
                "trans": "客人高兴地笑了，洗净酒杯重新饮酒。菜肴果品都已吃完，杯子盘子杂乱一片。大家互相枕着垫着睡在船上，不知不觉东方已经露出白色的曙光。"
            }
        ]
    },
    {
        "title": "琵琶行并序",
        "dynasty": "唐",
        "author": "白居易",
        "tags": [
            "必修一",
            "诗",
            "背默"
        ],
        "display": "center",
        "content": [
            {
                "display": "left",
                "line": "元和十年，予左迁九江郡司马。明年秋，送客湓浦口，闻舟中夜弹琵琶者，听其音，铮铮然有京都声。问其人，本长安倡女，尝学琵琶于穆、曹二善才，年长色衰，委身为贾人妇。遂命酒，使快弹数曲。曲罢悯然，自叙少小时欢乐事，今漂沦憔悴，转徙于江湖间。予出官二年，恬然自安，感斯人言，是夕始觉有迁谪意。因为长句，歌以赠之，凡六百一十六言，命曰《琵琶行》。",
                "trans": "元和十年，我被贬为九江郡司马。次年秋天，到湓浦口送客，听到邻舟有一女子在夜晚弹奏琵琶，细审那声音，铿铿锵锵颇有点京城的风味。我询问她的来历，原来是长安的歌女，曾经跟穆、曹这两位琵琶名家学习技艺，后来年长色衰，嫁给一位商人为妻。于是我吩咐摆酒，请她尽情地弹几支曲子。她演奏完毕，神态忧伤，叙说自己年轻时欢乐的往事，但如今漂泊沦落，憔悴不堪，在江湖之间飘零流浪。我出任地方官已将两年，一向心境平和，她的话却使我有所触动，这一晚竟然有被贬逐的感受。于是撰写了这首七言歌行，吟唱一番来赠送给她，一共有六百一十六字，命题为《琵琶行》。"
            },
            {
                "line": "浔阳江头夜送客，枫叶荻花秋瑟瑟。",
                "trans": "夜晚到浔阳江头送别客人，枫树、 芦荻被秋风吹得飒飒作响。"
            },
            {
                "line": "主人下马客在船，举酒欲饮无管弦。",
                "trans": "我和客人下马在船上设宴饯别，举起酒杯想要饮酒却无助兴的音乐。"
            },
            {
                "line": "醉不成欢惨将别，别时茫茫江浸月。",
                "trans": "酒喝得不痛快更伤心将要分别，临别时茫茫江水中浸着一轮冷月。"
            },
            {
                "line": "忽闻水上琵琶声，主人忘归客不发。",
                "trans": "忽然听见江面传来阵阵琵琶声，我忘却了回归，客人也不想动身。"
            },
            {
                "line": "寻声暗问弹者谁，琵琶声停欲语迟。",
                "trans": "寻着声源探问弹琵琶的是何人？琵琶声停了许久却迟迟不语。"
            },
            {
                "line": "移船相近邀相见，添酒回灯重开宴。",
                "trans": "我们移船靠近邀请她出来相见，重新拨亮灯光再添酒摆开宴席。"
            },
            {
                "line": "千呼万唤始出来，犹抱琵琶半遮面。",
                "trans": "千呼万唤她才缓缓地走出来，用怀里抱着的琵琶半遮着面。"
            },
            {
                "line": "转轴拨弦三两声，未成曲调先有情。",
                "trans": "她拧转弦轴，拨动弦丝，试弹了几声，还没弹成曲调却先有了感情。"
            },
            {
                "line": "弦弦掩抑声声思，似诉平生不得志。",
                "trans": "一弦弦凄楚悲切的声音隐含着深长的情思，似乎在诉说着她一生的不如意。"
            },
            {
                "line": "低眉信手续续弹，说尽心中无限事。",
                "trans": "她低着眉头随手慢慢地连续弹奏，尽情地倾诉心底无限的伤心事。"
            },
            {
                "line": "轻拢慢捻抹复挑，初为《霓裳》后《六幺》。",
                "trans": "轻轻抚拢慢慢捻揉下抹又上挑，初弹《霓裳羽衣曲》接着再弹《六幺》。"
            },
            {
                "line": "大弦嘈嘈如急雨，小弦切切如私语。",
                "trans": "大弦声音沉重抑扬如暴风骤雨，小弦细促轻幽、急切细碎，如人窃窃私语。"
            },
            {
                "line": "嘈嘈切切错杂弹，大珠小珠落玉盘。",
                "trans": "嘈嘈声切切声互为交错地弹奏，就像大珠小珠一颗颗掉落玉盘。"
            },
            {
                "line": "间关莺语花底滑，幽咽泉流冰下难。",
                "trans": "一会儿像黄鹂在花下啼鸣婉转流利，一会儿又像泉水在冰下流动滞涩不畅。"
            },
            {
                "line": "冰泉冷涩弦凝绝，凝绝不通声暂歇。",
                "trans": "好像冰泉冷涩琵琶声开始凝滞，凝滞而不通畅声音渐渐地停歇。"
            },
            {
                "line": "别有幽愁暗恨生，此时无声胜有声。",
                "trans": "像另有一种愁思幽恨暗暗滋生，此时闷闷无声却比有声更动人。"
            },
            {
                "line": "银瓶乍破水浆迸，铁骑突出刀枪鸣。",
                "trans": "突然间好像银瓶撞破水浆四溅，又好像铁甲骑兵厮杀刀枪齐鸣。"
            },
            {
                "line": "曲终收拨当心画，四弦一声如裂帛。",
                "trans": "一曲终了拨子从弦索中间划过四弦，一声轰鸣好像撕裂了布帛。"
            },
            {
                "line": "东船西舫悄无言，唯见江心秋月白。",
                "trans": "东西面的画舫、游船都静悄悄的，只看见江心之中映着的秋月泛着白光。"
            },
            {
                "line": "沉吟放拨插弦中，整顿衣裳起敛容。",
                "trans": "她沉吟着收起拨片插在琴弦中；然后整理一下衣服起身站立，收敛（深思时悲愤幽怨的）面部表情。"
            },
            {
                "line": "自言本是京城女，家在虾蟆陵下住。",
                "trans": "她说她本是京城负有盛名的歌女，老家住在长安城东南的虾蟆陵。"
            },
            {
                "line": "十三学得琵琶成，名属教坊第一部。",
                "trans": "十三岁就已学会弹奏琵琶技艺，名字登记在教坊乐团的第一部里。"
            },
            {
                "line": "曲罢曾教善才服，妆成每被秋娘妒。",
                "trans": "每曲弹罢都令艺术大师们叹服，每次妆成都被同行歌伎们嫉妒。"
            },
            {
                "line": "五陵年少争缠头，一曲红绡不知数。",
                "trans": "京城的富贵子弟争着赠送财物，每当一曲弹罢，不知要给多少彩绸。"
            },
            {
                "line": "钿头银篦击节碎，血色罗裙翻酒污。",
                "trans": "打拍子敲碎了镶嵌着花钿的篦形发饰，吃美酒染污了红色罗裙。"
            },
            {
                "line": "今年欢笑复明年，秋月春风等闲度。",
                "trans": "年复一年都在欢笑打闹中度过，秋去春来美好的时光白白消磨。"
            },
            {
                "line": "弟走从军阿姨死，暮去朝来颜色故。",
                "trans": "教坊的兄弟参军去了，当家的阿姨也死了，暮去朝来我也年老色衰。"
            },
            {
                "line": "门前冷落鞍马稀，老大嫁作商人妇。",
                "trans": "门前车马减少，光顾者寥寥，年岁大了我只得嫁给商人为妻。"
            },
            {
                "line": "商人重利轻别离，前月浮梁买茶去。",
                "trans": "商人重利不重情常常轻易别离，上个月他到浮梁买茶办货去了。"
            },
            {
                "line": "去来江口守空船，绕船月明江水寒。",
                "trans": "他去了留下我在江口孤守空船，只有秋月与我作伴，绕船的秋水凄寒。"
            },
            {
                "line": "夜深忽梦少年事，梦啼妆泪红阑干。",
                "trans": "深夜常常梦到少年时作乐狂欢，梦中哭醒涕泪纵横污损了粉颜。"
            },
            {
                "line": "我闻琵琶已叹息，又闻此语重唧唧。",
                "trans": "我听了琵琶声早已摇头叹息，又听到她这番诉说更加歔欷。"
            },
            {
                "line": "同是天涯沦落人，相逢何必曾相识！",
                "trans": "同样都是天涯沦落的可怜人，今日相逢何必问曾经是否相识！"
            },
            {
                "line": "我从去年辞帝京，谪居卧病浔阳城。",
                "trans": "自从去年我离开繁华长安京城，被贬居住在浔阳江畔便一直因病卧床。"
            },
            {
                "line": "浔阳地僻无音乐，终岁不闻丝竹声。",
                "trans": "浔阳这地方荒凉偏僻没有音乐，一年到头也听不见管弦奏鸣。"
            },
            {
                "line": "住近湓江地低湿，黄芦苦竹绕宅生。",
                "trans": "居住在湓江附近，低洼潮湿，院子周围，尽长些黄芦苦竹。"
            },
            {
                "line": "其间旦暮闻何物？杜鹃啼血猿哀鸣。",
                "trans": "在这里早晚能听到的是什么呢？尽是杜鹃猿猴那些悲凄的哀鸣。"
            },
            {
                "line": "春江花朝秋月夜，往往取酒还独倾。",
                "trans": "在春天江边花儿开放的早上，或在秋天明月高悬的夜晚，我常常取酒独酌独饮。"
            },
            {
                "line": "岂无山歌与村笛，呕哑嘲哳难为听。",
                "trans": "难道这里就没有山歌和村笛吗？只是那音调嘶哑粗涩实在难听。"
            },
            {
                "line": "今夜闻君琵琶语，如听仙乐耳暂明。",
                "trans": "今晚我听你弹奏琵琶诉说衷情，就像听到了天上的仙乐，让我的耳朵暂时得到了清明。"
            },
            {
                "line": "莫辞更坐弹一曲，为君翻作《琵琶行》。",
                "trans": "请你不要推辞坐下来再弹一曲；我要为你创作一首新诗《琵琶行》。"
            },
            {
                "line": "感我此言良久立，却坐促弦弦转急。",
                "trans": "被我的话所感动她站立了好久；回身坐下再转紧琴弦拨出急声。"
            },
            {
                "line": "凄凄不似向前声，满座重闻皆掩泣。",
                "trans": "凄凄切切不似刚才奏过的单调，在座的人重听都掩面哭泣不停。"
            },
            {
                "line": "座中泣下谁最多？江州司马青衫湿。",
                "trans": "要问在座之中谁流的眼泪最多？江州司马的青衫已被泪水浸湿！"
            }
        ]
    }
];
export default poems;